In [ ]:
# pandas lib
import numpy as np

list = [1,2,3,4]

arr = np.array([[[1,2,3,4]]])

# Series
list = [1,2,3,4]
tup = (1,23,4)
set = {1,2,3,5}

# DataFrame ,Table
dic = {'key': 'values'}

In [ ]:
!pip install pandas

In [ ]:
# 1 Series 
# pip3 install pandas
import pandas as pd

list = [1,2,3,4,5]
dic = {
    'name': 'Mg Mg', 
    'phone':'123123',
    'email':'abc@mail.com'
    }
dic2 = {
    'name':['mg mg', 'aung aung', 'ma ma', 'kyaw kyaw', 'aye aye'],
    'mark': [20,30,50, 50, 60]
}

ser = pd.Series(list, index=['a', 'b', 'c', 'd', 'e'])
ser1 = pd.Series(dic2)

df = pd.DataFrame(dic2)

print(ser1)
print(df)

In [ ]:
dic2 = {
    'name':['mg mg', 'aung aung', 'ma ma', 'kyaw kyaw', 'aye aye'],
    'mark': [20,30,50, 50, 60]
}

df = pd.DataFrame(dic2)

print(df.loc[2])
print(df.iloc[4,0])

In [ ]:
data = pd.read_excel(r'C:\Users\E15\Desktop\PythonSept\myfle.xlsx')
# data.head(10)
# data.tail(7)
# data.info()
data.describe()

In [59]:
import sqlite3
conn = sqlite3.connect('example.db')
query = "SELECT * FROM students"

df = pd.read_sql_query(query, conn)

df

   id      name      phone    address
0   1     mg mg  123123123     yangon
1   2     ma ma  123123123   mandalay
2   3  kyawkayw     232323  naypyitaw
3   4   aye aye     787878        ygn